@extends('frontend.layout', ['title' => 'О нас'])

@section('content')
    <div class="fatherBlock p-5">
        <div class="cotnainer-fluid">
            <div class="container">
                <div class="row">
                    <div class="col-sm-12">
                        <h1>О нас</h1><br><br>

                        <p>4 февраля 2019 года в г. Нур-Султане произошел пожар, в результате которой погибли пятеро девочек-сестер. Эта трагедия потрясла учредителей ОО &laquo;Менің Атамекенiм&raquo; и заставила их задуматься о том, как можно избежать повторения аналогичных ситуаций в будущем. В результате была создана первая версия веб-сайта <a class="text-entity-link" dir="auto" title="http://Аtamekenim.kz" href="http://xn--tamekenim-zyh.kz/" target="_blank" rel="noopener noreferrer">Аtamekenim.kz</a>, через которую люди начали отправлять заявки в надежде получить помощь и выйти из тяжелой жизненной ситуации, а неравнодушные могли откликнуться на эти просьбы. <br />Ресурс оказался настолько востребованным, что вскоре был организован колл-цент для обработки запросов от населения. Общее количество заявок превысило 60 тысяч. География заявок охватывала весь Казахстан. За время работы ресурса была оказана помощь более 4000 семей, порядка 2000 детей, было приобретено жилье для пяти семей. Был запущен телевизионный проект, освещающий реализацию полученных заявок. <br />С каждым днем заявок становилось все больше, и ОО пришло к осознанию необходимости автоматизации процесса их сбора, категоризации и верификации. Была инициирована соответствующая работа с МОН РК, МТСЗ РК, МИОР РК и другими гос. органами, а также НПП &laquo;Атамекен&raquo;. Спустя год, ОО получило возможность интеграции с государственными базами данных для работы в сфере благотворительности. Следующий год ушел на разработку за свой счет платформы по приему заявок от населения. Теперь ОО могло дать заявителям возможность формировать заявки на получение помощи гораздо быстрее и проще &ndash; без длительной переписки и необходимости сбора огромного количества документов. <br />Поскольку данная система обработки запросов заявителей оказалась эффективной, ОО решило не просто самостоятельно использовать полученные наработки, но и поделиться ими с другими благотворительными организациями Казахстана. Так родилась идея создания единой приемной благотворительных организаций Казахстана. <br />Работа над созданием единой приемной благотворительных организаций Казахстана закончилась в январе 2022 года. Несмотря на то, что платформа уже является рабочим инструментом, с помощью которого можно подавать заявки на получение помощи, функционал платформы реализован еще не в полной мере. Команда разработчиков постоянно работает над увеличением функционала платформы, чтобы ее использование стало еще более простым и удобным. Если у Вас есть предложения по улучшению работы платформы, Вы можете направлять их по адресу: <a class="text-entity-link" dir="auto" href="mailto:charity@ermek.kz" target="_blank" rel="noopener noreferrer">charity@ermek.kz</a></p>

                    </div>
                </div>
            </div>
        </div>
    </div>
@endsection