<?php

use Illuminate\Database\Seeder;

class AddHelpTypeSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //
        $types = [
            'Здоровье' => [
                'description' => [
                    'Лекарство',
                    'Лечение',
                    'Диагностика',
                    'Реабилитация',
                    'Услуги сиделки',],
                'scenario_id' => [1, 2, 3, 5],
                'name_kz' => 'Денсаулық',
                'description_kz' => 'дәрі-дәрмектер, емдеу, диагностика, оңалту, медициналық жабдықтар, медбике қызметтері',
            ],
            'Образование' => [
                'description' => [
                    'Обучение',
                    'Доп.образование',
                    'Оборудование и инструменты',
                ],
                'scenario_id' => [1, 2, 3, 5],
                'name_kz' => 'Білім беру',
                'description_kz' => 'оқыту, қосымша білім беру, жабдықтар мен құралдар',
            ],
            'Базовые потребности' => [
                'description' => [
                    'Продукты питания',
                    'Одежды',
                    'Предметы быта',
                ],
                'scenario_id' => [1, 2, 3, 5],
                'name_kz' => 'Базалық қажеттіліктер',
                'description_kz' => 'азық-түлік, киім-кешек, тұрмыстық заттар',
            ],
            'Исскуство и культура' => [
                'description' => [
                    'Оборудование и инструменты',
                    'материалы',
                    'Организация мероприятий',
                    'Объекты культуры'
                ],
                'scenario_id' => [1, 2, 3, 5],
                'name_kz' => 'Өнер және мәдениет',
                'description_kz' => 'жабдықтар мен құрал-саймандар, материалдар, іс-шараларды ұйымдастыру, мәдениет объектілері',
            ],
            'Трудоустройство' => [
                'description' => [],
                'scenario_id' => [1, 2, 3],
                'name_kz' => 'Жұмыспен қамту ',
            'description_kz' => ''],
            'Наука' => [
                'description' => [
                    'Исследования',
                    'Оборудование и инструменты',
                    'Научные мероприятия'
                ],
                'scenario_id' => [1, 2, 3, 5],
                'name_kz' => 'Ғылым',
                'description_kz' => 'зерттеу, жабдықтар мен құралдар, ғылыми іс-шаралар өткізу',
            ],
            'Жилье' => [
                'description' => [
                    'Аренда',
                    'Покупка',
                    'Временное жилье'
                ],
                'scenario_id' => [1, 2, 3],
                'name_kz' => 'Тұрғын үй',
                'description_kz' => 'жалға алу, сатып алу, уақытша баспана',
            ],
            'Спорт' => [
                'description' => [
                    'Инвентарь',
                    'Организация мероприятий',
                    'Спортивные объекты'
                ],
                'scenario_id' => [1, 2, 3, 5],
                'name_kz' => 'Спорт',
                'description_kz' => 'инвентарь, іс-шараларды ұйымдастыру, спорт объектілері',
            ],
            'Жилищные условия' => [
                'description' => [
                    'Ремонт',
                    'Ком. услуги',
                    'Отопление',
                    'Водоснабжение',
                    'Газификация'
                ],
                'scenario_id' => [1, 2, 3, 5],
                'name_kz' => 'Тұрғын үй жағдайлары',
                'description_kz' => 'Жөндеу, Коммуналдық қызметтер, жылу беру, сумен жабдықтау, газдандыру',
            ],
            'Гражданские права' => [
                'description' => [
                    'Имущественные',
                    'Наследственные',
                    'Коммерческие'
                ],
                'scenario_id' => [1, 2, 3, 5],
                'name_kz' => 'Азаматтық құқықтар',
                'description_kz' => 'мүліктік, мұрагерлік, коммерциялық',
            ],
            'Урбанизация' => [
                'description' => [
                    'Инфраструктурные объекты',
                    'Организация пространства'
                ],
                'scenario_id' => [4],
                'name_kz' => 'Урбанизациялау',
                'description_kz' => 'инфрақұрылымдық объектілер, кеңістікті ұйымдастыру',
            ],
            'Экология' => [
                'description' => [
                    'Флора и фауна',
                ],
                'scenario_id' => [4],
                'name_kz' => 'Экология',
                'description_kz' => 'флора мен фауна',
            ],
            'Развитие сельских территорий' => [
                'description' => [
                    'Инфраструктурные объекты',
                    'Организация пространства'
                ],
                'scenario_id' => [4],
                'name_kz' => 'Ауылдық өңірлерді дамыту',
                'description_kz' => 'инфрақұрылымдық объектілер, кеңістікті ұйымдастыру',
            ],
            'Помощь бизнесу' => [
                'description' => [
                    'Проекты социального предпринимательства',
                    'Поддержка инициатив'
                ],
                'scenario_id' => [1, 2, 3, 4, 5],
                'name_kz' => 'Бизнеске көмек',
                'description_kz' => 'әлеуметтік кәсіпкерлік жобалары, бастамаларды қолдау',
            ],
            'Забота о животных' => [
                'description' => [
                    'Содержание',
                    'Ветиринарные услуги'
                ],
                'scenario_id' => [5,6],
                'name_kz' => 'Жануарларға қамқорлық',
                'description_kz' => 'ұстау, ветеринарлық қызмет көрсету',
            ],
            'Помещение в питомник' => ['description'=>[],'scenario_id' => [6],'name_kz' => 'Питомникке орналастыру','description_kz' => ''],
        ];

        foreach ($types as $parent => $description) {
            $typesParent = \App\AddHelpType::where('name_ru', $parent)->first();
            if (!$typesParent) {
                $addHelpType = \App\AddHelpType::create([
                    'name_ru' => $parent,
                    'name_kz' => $description['name_kz'],
                    'description_ru' => implode(',', $description['description']),
                    'description_kz' => $description['description_kz'],
                ]);
                $addHelpType->scenarios()->attach($description['scenario_id']);
            }
        }
    }
}
