<?php

use Illuminate\Database\Seeder;
use \Illuminate\Support\Facades\DB;

class DestinationSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $destinations = [
            [
                'Ребонок'=>['name_kz'=>'Бала','scenario_id'=>[2,3]],
                'Школник'=>['name_kz'=>'Мектеп оқушысы','scenario_id'=>[2,3]],
                'Студент'=>['name_kz'=>'Студент','scenario_id'=>[2,3]],
                'Безработный'=>['name_kz'=>'Жұмыссыз','scenario_id'=>[2,3]],
                'Трудоустроенный'=>['name_kz'=>'Жұмысқа орналасқан','scenario_id'=>[2,3]],
                'Пенсионер'=>['name_kz'=>'Зейнеткер','scenario_id'=>[2,3]],
                'Малообеспеченный'=>['name_kz'=>'Аз қамтылған','scenario_id'=>[1,2,3]],
                'Сирота или оставщийся без попечения родителей'=>['name_kz'=>'Жетім немесе ата-анасының қамқорлығынсыз қалған','scenario_id'=>[2,3]],
                'Многодетная мать'=>['name_kz'=>'Көп балалы ана','scenario_id'=>[2,3]],
                'Неполная семья'=>['name_kz'=>'Толық емес отбасы','scenario_id'=>[1,2,3]],
                'Многодетная семья'=>['name_kz'=>'Көп балалы отбасы','scenario_id'=>[1,2,3]],
                'Ветеран ВОВ, труда или приравненные к ним'=>['name_kz'=>'ҰОС Ардагері, еңбек немесе оларға теңестірілген','scenario_id'=>[2,3]],
                'Герой'=>['name_kz'=>'Батыр','scenario_id'=>[2,3]],
                'Талант'=>['name_kz'=>'Талант','scenario_id'=>[2,3]],
                'Семьи погибших при спасании человоческой жизни'=>['name_kz'=>'Адам өмірін құтқару кезінде қаза тапқандардың отбасылары','scenario_id'=>[1,2,3]],
                'Получающий пособие (АСП, о потере кормильца, по рождению ребенка до года, по уходу за ребенком инвалидом)'=>['name_kz'=>'Жәрдемақы алушы (атаулы әлеуметтік көмек, асыраушысынан айырылу бойынша, бір жылға дейін бала тууы бойынша, мүгедек бала күтімі бойынша жәрдемақы)','scenario_id'=>[1,2,3]],
            ],
            [
                'Одинокие люди'=>['name_kz'=>'Жалғыз адамдар','scenario_id'=>[1,2,3]],
                'Пострадавшие от ЧС, стихийных бедствии'=>['name_kz'=>'ТЖ, табиғи апаттардан зардап шеккендер','scenario_id'=>[1,2,3]],
                'Жертвы бытового насилия'=>['name_kz'=>'Тұрмыстық зорлық-зомбылық құрбандары','scenario_id'=>[1,2,3]],
                'Жертвы психологического насилия'=>['name_kz'=>'Психологиялық зорлық-зомбылық құрбандары','scenario_id'=>[1,2,3]],
                'Жертвы торговли людьми'=>['name_kz'=>'Адам саудасының құрбандары','scenario_id'=>[1,2,3]],
                'Зависимость (наркомания, игромания, алкоголизм и т.д.)'=>['name_kz'=>'Тәуелділік (нашақорлық, құмар ойындар, алкоголизм және т. б.)','scenario_id'=>[1,2,3]],
                'Осуждение'=>['name_kz'=>'Сотталғандар','scenario_id'=>[1,2,3]],
                'Люди без определенного места жительства'=>['name_kz'=>'Белгілі бір тұрғылықты жері жоқ адамдар','scenario_id'=>[1,2,3]],
            ],
            [
                'Кандасы'=>['name_kz'=>'Қандастар','scenario_id'=>[1,2,3]],
                'Выходцы из сел'=>['name_kz'=>'Ауылдан шыққан жастар','scenario_id'=>[1,2,3]],
                'Проживающие за рубежом'=>['name_kz'=>'Шетелде тұратын','scenario_id'=>[1,2,3]],
            ],
            [
                'Инвалидность (1,2,3 группы)'=>['name_kz'=>'Мүгедектік (1, 2, 3 топ)','scenario_id'=>[1,2,3]],
                'Детский церебральный паралич'=>['name_kz'=>'Балалардың церебралды сал ауруы','scenario_id'=>[1,2,3]],
                'Расстройство аутистического спектра'=>['name_kz'=>'Аутизм спектрінің таралуы','scenario_id'=>[1,2,3]],
                'Генетические заболевания'=>['name_kz'=>'Генетикалық аурулар','scenario_id'=>[1,2,3]],
                'Психологические расстройства'=>['name_kz'=>'Психологиялық келіспеушіліктер','scenario_id'=>[1,2,3]],
                'Хронические заболевания'=>['name_kz'=>'Созылмалы аурулар','scenario_id'=>[1,2,3]],
                'Синдрома Дауна'=>['name_kz'=>'Даун синдромы','scenario_id'=>[1,2,3]],
                'Глухие и слабослышащие'=>['name_kz'=>'Саңырау және нашар еститін','scenario_id'=>[1,2,3]],
                'Слепые и слабовидящие'=>['name_kz'=>'Зағип және нашар көретін','scenario_id'=>[1,2,3]],
                'Онкологические заболевания'=>['name_kz'=>'Онкологиялық аурулар','scenario_id'=>[1,2,3]],
                'Болеющие ВИЧ, СПИД'=>['name_kz'=>'АИТВ, ЖИТС-пен ауыратындар','scenario_id'=>[1,2,3]],
                'Болеющие туберкулезом'=>['name_kz'=>'Туберкулезбен ауыратындар','scenario_id'=>[1,2,3]],
            ]

        ];

        foreach($destinations  as $k=> $item){
            foreach ($item as $value =>$keys){
                if(!DB::table('destinations')->where('name_ru', $value)->first()){
                    $data = [
                        'parent_id' => $k,
                        'name_ru'=>$value,
                        'name_kz'=>$keys['name_kz'],
                    ];
                    $destination = \App\Destination::create($data);
                    $destination->scenarios()->attach($keys['scenario_id']);
                }
            }

        }
    }
}
