<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Str;

class NewsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {

        $data = [
            [
                'title_ru' => 'Помощь обучающимся в период карантина 2020 г.',
                'title_kz' => '2020 жылғы карантин кезеңінде білім алушыларға көмек',
                'body_ru' => 'При переходе на удаленное образование не все семьи имеют дома компьютер, ноутбук или планшет, необходимый для процесса обучения детей. В связи с этим целью проекта является привлечение общественности и представителей бизнеса для приобретения необходимой техники, чтобы каждый школьник получил возможность продолжать учиться в школе. На собранные средства будет закуплена необходимая техника, которая будет передана на баланс конкретной школы для целевого использования учениками.',
                'body_kz' => 'Қашықтан білім алуға көшу кезінде барлық отбасыларда үйде балаларды оқыту процесіне қажетті компьютер, ноутбук немесе планшет бола бермейді. Осыған байланысты жобаның мақсаты әрбір оқушы мектепте оқуын жалғастыруға мүмкіндік алуы үшін қажетті техниканы сатып алу үшін жұртшылық пен бизнес өкілдерін тарту болып табылады. Жиналған қаражатқа қажетті техника сатып алынады, ол оқушылардың мақсатты пайдалануы үшін нақты мектептің теңгеріміне беріледі.',
                'public_date' => date('Y-m-d', strtotime('2020-11-19')),
            ],
            [
                'title_ru' => 'Благотворительность и волонтерство приняли общенациональный масштаб - К.Токаев',
                'title_kz' => 'Қайырымдылық пен еріктілік жалпыұлттық ауқымды қабылдады - К.Токаев',
                'body_ru' => 'Источник: https://24.kz/ru/news/top-news/item/426453-blagotvoritelnost-i-volontjorstvo-prinyali-obshchenatsionalnyj-masshtab-k-tokaev Любое использование материалов допускается только при наличии гиперссылки на www.24.kz',
                'body_kz' => 'Ақпарат көзі: https://24.kz/ru/news/top-news/item/426453-blagotvoritelnost-i-volontjorstvo-prinyali-obshchenatsionalnyj-masshtab-k-tokaev',
                'public_date' => date('Y-m-d', strtotime('2020-12-18')),
            ],[
                'title_ru' => 'Токаев предложил ввести Реестр благотворительных организаций',
                'title_kz' => 'Тоқаев қайырымдылық ұйымдарының тізілімін енгізуді ұсынды',
                'body_ru' => 'Президент Казахстана Касым-Жомарт Токаев выступил на церемонии закрытия Года волонтёра, сообщается на сайте Акорды. Реестр должен быть интегрирован во все действующие информационные системы этой сферы, подчеркнул Президент.Президент Казахстана Касым-Жомарт Токаев на церемонии закрытия Года волонтера предложил ввести Реестр благотворительных организаций, передает Today.kz со ссылкой на Акорду."В целях обеспечения прозрачности благотворительной деятельности стоит подумать о вопросе введения Реестра благотворительных организаций. Он должен быть интегрирован во все действующие информационные системы этой сферы. Нужно сделать его доступным любому, кто пожелает ознакомиться с деятельностью благотворительных организаций, их финансовой отчетностью", - отметил Глава государства.',
                'body_kz' => 'Ақпарат көзі: https://24.kz/ru/news/top-news/item/426453-blagotvoritelnost-i-volontjorstvo-prinyali-obshchenatsionalnyj-masshtab-k-tokaev',
                'public_date' => date('Y-m-d', strtotime('2020-11-19')),
            ],

        ];


        foreach ($data as $datum) {
            if (!\Illuminate\Support\Facades\DB::table('news')->where('title_ru', $datum['title_ru'])->first()) {
                $datum['slug'] = Str::slug($datum['title_ru']);
                \App\News::create($datum);
            }
        }
    }
}