<?php
return [
    "Отметьте социальный статус бенефициаров. Если Ваша организация помогает людям с определенным социальным статусом, Вы можете отметить это звездочкой. Это будет означать, что в Вашу организацию будут поступать заявки с просьбой о помощи только с указанными Вами критериями.",
    "Отметьте жизненную ситуацию бенефициаров. Если Ваша организация помогает людям, находящимся в определенной жизненной ситуации, Вы можете отметить это звездочкой. Это будет означать, что в Вашу организацию будут поступать заявки с просьбой о помощи только с указанными Вами критериями. ",
    "Отметьте бенефициаров, исходя из его происхождения. Если Ваша организация помогает людям с  определенным происхождением, Вы можете отметить это звездочкой.  Это будет означать, что в Вашу организацию будут поступать заявки с просьбой о помощи только с указанными Вами критериями. ",
    "Отметьте бенефициаров, исходя из его статуса по здоровью. Если Ваша организация помогает людям с  определенным статусом по здоровью, Вы можете отметить это звездочкой.  Это будет означать, что в Вашу организацию будут поступать заявки с просьбой о помощи только с указанными Вами критериями. ",
];
