<?php

return [
    'main' => 'Басты',
    'reestr' => 'Қайырымдылық ұйымдар тізілімі ',
    'filtr-search' => 'Іздеу фильтрі',
    'filtr-search-text' => 'Ұйымның атауын көрсетіңіз немесе іздеу фильтрді пайдаланыңыз',
    'search-bin' => 'Атауы немесе БСН бойынша іздеу',
    'more-org' => 'Ұйым туралы толығырақ ',
    'req-help' => 'Көмек алуға өтінім беру',
    'supp-org' => 'Ұйымды қолдау',
    'reg-reestr' => 'Тізілімде тіркеу',
    'more-analytics' => 'Талдау көбірек',
    'found' => 'Табылды',
    'org' => 'ұйым ',
    'find' => 'Табу',
    'sector-activities' => 'Көмек көрсету саласы',
    'adresat' => 'Көмек алушылар',
    'regions' => 'Өңір',
    'human-family' => 'Жеке адамдар мен отбасылар үшін',
    'help-soc' => 'Қауымдастықтарға көмек',
    'help-animal' => 'Жануарларға көмек',
    'help-type' => 'Көрсетілетін көмек түрлері',
    'type-help' => 'Көмек типі',
    'help-size' => 'Көмек мөлшері',
    '' => '',

];