<?php

return [
    'main' => 'Главная',
    'reestr' => 'Реестр благотворительных организаций',
    'filtr-search' => 'Фильтр поиска',
    'filtr-search-text' => 'Укажите название организации или используйте фильтр поиска',
    'search-bin' => 'Поиск по названию или БИН',
    'more-org' => 'Подробнее об организации ',
    'req-help' => 'Подать заявку на получение помощи',
    'supp-org' => 'Поддержать организацию',
    'reg-reestr' => 'Регистрация в реестре',
    'more-analytics' => 'Больше аналитики',
    'found' => 'найдено',
    'org' => 'организаций',
    'find' => 'Найти',
    '' => '',

];