<?php

return [
    'reestr-appl' => 'Реестр заявок',
    'search-fond' => 'Поиск по слову, фонду или другому',
    'new-appl' => 'Новые заявки',
    'health' => 'Здоровье',
    'edu' => 'Образование',
    'masloy' => 'Базовые потребности',
    'culture' => 'Исскуство и культура',
    'trud' => 'Трудоустройство',
    'find' => 'Найти',
    'ras-search' => 'Расширенный поиск',
    'summ-help' => 'Необходимая сумма благотворительной помощи',
    'repeat' => 'На постоянной основе',
    'place-help' => 'Место оказания помощи:',
    '' => '',
    ];